app/controllers/access_controller.rb

  def login
    users = User.all
---
SELECT "users".* FROM "users"

  def attempt_login
    if params[:username].present? && params[:password].present?
      user = User.where(username: params[:username]).first
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["username", "vinsonly"], ["LIMIT", 1]]

  def sign_up
    new_user = User.new(username: params[:username], name: params[:name], email: params[:email], password: params[:password])
    if new_user.save
---
INSERT INTO "users" ("username", "name", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"