app/controllers/admin_controller.rb

  def index # list of all users, where admin can select users to perform operations
    @users = User.all
---
SELECT "users".* FROM "users"

  def destroy
    #destroys a user and posts changes to the database
    @confirm = params[:confirm]

    toBeDeleted = User.find(params[:user_id]) #finds the user object to be deleted
    @username = toBeDeleted.username
    @first_name = toBeDeleted.name
    # add last_name
    @email = toBeDeleted.email
    @admin = toBeDeleted.admin
    @created_at = toBeDeleted.created_at
    @updated_at = toBeDeleted.updated_at
    @user_id = toBeDeleted.id

    #check if the user is trying to delete themselves, dont let them
    if (@confirm == @username)
      @message = "[User ID:#{@user_id}] deleted."
      toBeDeleted.destroy #destroy the user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]

  def create_user #creates a new admin and posts to databse
    @username = params[:username]
    @name = params[:first_name]
    @password = params[:password]
    @confirm_password = params[:confirm_password]
    @email = params[:email]
    @admin = params[:admin]

    if(@password != @confirm_password)
      @message = "Error! Passwords do not match."
      redirect_to :action => "new_user", :message => @message and return
    end

    newUser = User.new()
    newUser.username = @username
    newUser.name = @name
    newUser.password = @password
    newUser.email = @email
    if (@admin == "true")
      newUser.admin = true
    else
      newUser.admin = false
    end
    if(newUser.save == true)
---
INSERT INTO "users" ("username", "name", "password_digest", "email", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def make_edit
    @user_id = params[:user_id]

    @username_old = params[:username_old]
    @first_name_old = params[:first_name_old]
    @email_old = params[:email_old]
    @admin_old = params[:admin_old]

    @username = params[:username]
    @first_name = params[:first_name]
    # add last_name
    #@password = params:[:password]
    @email = params[:email]
    @admin = params[:admin]

    toEdit = User.find(@user_id)
    toEdit.username = @username
    toEdit.name = @first_name
    toEdit.email = @email
    if (@admin = "true")
      toEdit.admin = true
    else
      toEdit.admin = false
    end
    toEdit.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "admin" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "VinsonL"], ["admin", "t"], ["updated_at", "2017-11-09 22:49:38.899658"], ["id", 5]]