app/controllers/history_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 AND (extract(year  from date_column) = 2017) AND (extract(month from date_column) = 11) ORDER BY "transactions"."date" DESC  [["user_id", 1]]
---
    end

    # Get the current logged in user
    user = User.find(session[:user_id])
    # Get all the user's transactions
    transactions = user.transactions.order(:date => :desc)